teste_tecnico_laager_backend/app/controllers/participants_controller.rb

  def upvote
    Rails.logger.info("Incrementing vote for participant #{@participant.id}")
    @participant.increment!(:total_votes)
---
UPDATE "participants" SET "total_votes" = COALESCE("total_votes", 0) + $1 WHERE "participants"."id" = $2  [["total_votes", 1], ["id", 1]]

  def index
    @participants = Participant.all.order_by_name
---
SELECT "participants".* FROM "participants" ORDER BY "participants"."name" ASC