teste_tecnico_laager_backend/app/controllers/participants_controller.rb

SELECT "participants".* FROM "participants" ORDER BY "participants"."total_votes" DESC
---
  def index
    begin
      Rails.logger.info("Listando participantes")
      @participants = Participant.all.select_id_name_and_total_votes

SELECT "participants".* FROM "participants" WHERE "participants"."id" = $1 LIMIT $2  [["id", "a8137347-399e-4a23-9831-7d50569e74e4"], ["LIMIT", 1]]
---
    def set_participant
      id = params[:id]

      # unless é um if ao contrário
      # nesse caso verificando se o id não é um número
      unless id.to_s.match?(/\A\d+\z/)
        Rails.logger.error("Id #{id} is not a number")
        render status: :bad_request
        return
      end

      @participant = Participant.find_by(id: id)