teste_tecnico_laager_backend/app/controllers/participants_controller.rb

  def upvote
    Rails.logger.info("Incrementing vote for participant #{@participant.id}")
    @participant.increment!(:total_votes)
---
UPDATE "participants" SET "total_votes" = $1, "updated_at" = $2 WHERE "participants"."id" = $3  [["total_votes", 1], ["updated_at", "2025-09-28 14:24:45.038928"], ["id", "0af19366-7ec5-48bb-a2f0-4a87f572cf2f"]]

  def index
    @participants = Participant.all.order_by_name
---
SELECT "participants".* FROM "participants"

  def statistics
    @participants = Participant.select_only_name_and_total_votes
---
SELECT "participants".* FROM "participants"

    def set_participant
      id = params[:id]

      # unless é um if ao contrario
      # nesse caso verificando se o id não é um número
      unless id.to_s.match?(/\A\d+\z/)
        Rails.logger.error("Id #{id} is not a number")
        render status: :bad_request
        return
      end

      # not found se o participante não for encontrado
      @participant = Participant.find(id)
---
SELECT "participants".* FROM "participants" WHERE "participants"."id" = $1 LIMIT $2  [["id", "a8137347-399e-4a23-9831-7d50569e74e4"], ["LIMIT", 1]]